{
  "claim-number": "MAINT-ENG-20250805-005",
  "subject": "URGENT: CRITICAL AND RECURRING ENGINE E OVERHEATING - INCOMPETENT PREVIOUS REPAIR",
  "content": "To the Maintenance Control Team and **WHATEVER** crew signed off on the last work order for this engine,\n\nI am filing this **emergency** Maintenance Discrepancy Report (MDR) on **August 5th, 2025**, for the **THIRD TIME THIS MONTH** concerning a persistent and dangerously high engine temperature issue on **Engine E**.\n\nThis is not a new defect; it's a **recurring fault** that should have been fixed previously. The issue is logged as **MAINT-ENG-20250805-005**.\n\n**Observed Discrepancy (Equipment: Engine E - Turbofan):**\n\nThe pilot reported severe **Overheating** during the climb-out phase, with CHT (Cylinder Head Temperature) gauges spiking **well into the red line** (450 degrees Fahrenheit exceeded!) forcing an immediate power reduction and a return to base. The engine is running unacceptably hot, indicating a catastrophic failure of the cooling management system.\n\n**Action Taken/Request (Required Procedure: Replace thermostat and clean cooling system):**\n\nThe aircraft has been tagged for unscheduled maintenance at the gate. I have personally put a lock on the thrust lever and notified the shift supervisor that this aircraft is **NIL GO**. The previous 'inspection' clearly failed to address the root cause.\n\nI demand an immediate dispatch of a **Level 3 Powerplant Specialist** to execute the following, **CORRECTLY THIS TIME**: **1. Replace the primary thermostat** using a certified OEM part, as the current one is clearly seized shut. **2. Completely flush and clean the entire cooling system/heat exchanger**, as it is likely contaminated with sludge from the repeated overheating events. If this engine is not fixed properly now, we risk a **Catastrophic In-Flight Shut Down (IFSD)**. We are sick of band-aid fixes.\n\n**Contact Information:**\n\n**Aircraft Location:** Maintenance Bay Alpha - Far End (Where the problems get sent)\n**Contact Name:** Robert 'Rob' Harrison, Lead Powerplant Mechanic (and extremely frustrated)\n**Phone:** (555) 888-0000\n**Email:** robert.harrison@airmaint.com\n\nI expect a high-priority work order and confirmation that a competent team is addressing this dangerous, recurring snag **NOW**.\n\nSincerely,\nRobert Harrison\nLead Powerplant Mechanic"
}
